In [19]:
import pandas as pd
import numpy as np

In [20]:
df = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9],
                   [np.nan, np.nan, np.nan]],
                  columns=['A', 'B', 'C'])

In [21]:
df

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [22]:
df.agg(['sum','min'])

        A     B     C
sum  12.0  15.0  18.0
min   1.0   2.0   3.0

In [23]:
# different aggregations per column
df.agg({'A' : ['sum', 'min'], 'B' : ['min', 'max']})

        A    B
sum  12.0  NaN
min   1.0  2.0
max   NaN  8.0

In [24]:
#Aggregate different functions over the columns and rename the index of the resulting DataFrame.

In [25]:
df.agg(x=('A', max), y=('B', 'min'), z=('C', np.mean))

     A    B    C
x  7.0  NaN  NaN
y  NaN  2.0  NaN
z  NaN  NaN  6.0

In [26]:
# Aggregate over the columns
df.agg("mean", axis="columns")

0    2.0
1    5.0
2    8.0
3    NaN
dtype: float64

In [27]:
df = pd.DataFrame([[1,1, 2, 3],
                   [4,2, 1, 2],
                   [4,3, 2, 9],
                   [5,3, 2, 9],
                   [5,3, 2, 9],
                   [5,np.nan, 2, np.nan]],
                   columns=['BREAK','A', 'B', 'C'])

In [28]:
df

   BREAK    A  B    C
0      1  1.0  2  3.0
1      4  2.0  1  2.0
2      4  3.0  2  9.0
3      5  3.0  2  9.0
4      5  3.0  2  9.0
5      5  NaN  2  NaN

In [29]:
grouped=df.groupby('BREAK')

In [30]:
ndf=grouped.apply(lambda x: np.average(x.B, weights=x.A))

In [31]:
ndf

BREAK
1    2.0
4    1.6
5    NaN
dtype: float64

In [32]:
ndf.dtypes

dtype('float64')

In [33]:
df2=pd.DataFrame(ndf)

In [34]:
df2

         0
BREAK
1      2.0
4      1.6
5      NaN

In [37]:
df2.columns.rename(0,'A')

In [38]:
df2

0        0
BREAK
1      2.0
4      1.6
5      NaN